[
    {
      "date": "Nov 3rd, 2024",
      "data": [
        "\n        <h3>Making the Halloween Minigame</h3>\n        <p>Last month I released the Halloween Minigame on this site. Being the first seasonal minigame, I had to build the framework for future minigames. If you haven’t played the minigame, it’s a fast-paced shooter that tests your reflexes as you blast falling pumpkins with a purple lightning bolt. I got the idea of a lightning bolt from one of my favorite '80s movies; Ghostbusters. I created the music as an experiment on \n        <a href='https://jummb.us'>JummBox</a> \n        and surprised myself with a decent tune, so \n        <a href='https://github.com/GreyBeard42/greybeard42.github.io/releases/tag/v4.2.5' >I added it to the Minigame on November 2nd.</a> \n        I could've had the music added on Halloween day, but my Codespaces Quota had expired for the month. If you want to play the minigame any time of the year, just open up the developer console (F12 or Right Click menu -> Inspect) and type \"halloween()\" in the \"Console\" tab.</p>\n        \n        <h3>Struggling with p5.js Tile-based Game</h3>\n        <p>I've tried to work with grids of images in <a href=\"https://p5js.org\">p5.js</a>, and always seem froget how HARD AND PAINFUL it is to make the collision for each square. If you've taken your time scrolling through the JavaScript page, you would know that on April 1st (unintentional) this year, I created a <i>really simple</i> grid-based farming game. It did take many hours, but I did successfully make collision from scratch. But then, on a dark Halloween night, I had the idea to make a Pokemon-like RPG game with beautiful pixel art and effects. Man, I really frogot about the nonsense equations. I am no professional, I am certian someone wiser than me could achive this.</p>\n        \n        <h3>An upcoming JavaScript project</h3>\n        <p>Since you've read through most of this page, I thought I'd treat you with my next project to be worked on after this <a href=\"blog.js\">Blog Script</a> has been commited to the site. I'm going to make a Planner for Classwork and/or Hobbies. I've been using a private GitHub Project for planning out updates for this site and I've decided I want to give a shot at making my own organizer. So far, I hope to make Local Storage, Save Files, and Customizable Styles for it. If I choose to go all the way with this project, it could be done by December.</p>\n        ",
        "\n        <img src='images/blog/halloween.png'>\n        <p>A screenshot of the Halloween Minigame. The text reads, \"Click to blast those dang pumpkins! | Score: 90\" *This was before the v4.2.2 update when I moved the text in front of the pumpkins and bolt.</p>\n        \n        <img src=\"images/art/lakeHills.png\" style=\"image-rendering: pixelated;\">\n        <p>My Latest Pixel art of a pretty lake that I hiked around this summer.</p>\n\n        <div style=\"display: flex;\">\n            <div class=\"column\" style=\"flex: 1;\">\n                <img src=\"images/blog/lecture.png\">\n                <p>Lecture commenting on a user's choice in media as they flex their fingers in preparation to play tetris.</p>\n                <img src=\"images/blog/tileBasedFail.png\">\n                <p>A screenshot of the Tile-Based game that caused me so much greif. I do not recomend this!</p>\n            </div>\n            <div class=\"column\" style=\"flex: 1;\">\n                <img src=\"images/blog/editingLecture.png\">\n                <p>Editing the manefest.json file in Lecture using VSCode.</p>\n                <img src=\"images/blog/cometSense.png\">\n                <p>A screenshot of Comet Sense being \"edited\" in VSCode</p>\n            </div>\n        </div>\n        ",
        "\n        <h3>Lecture - My Chrome Extension</h3>\n        <p><a href='https://github.com/GreyBeard42/lecture'>Lecture</a> \n        is a chrome extension I made that lectures you on the pages you visit. I enjoyed learning how to make a chrome extension learning about manifest.json files, Key files, and advanced CSS styling. The hardest thing about making this extension was ironically writing the lectures and coming up with ideas since I'm regularly on many of the lecture sites. (If you have any ideas, tell me; I'll add them to the database) I created it locally in VSCode learning from \n        <a href=\"https://developer.chrome.com/docs/extensions/get-started\">Google's awesome tutorials</a> \n        and <a href=\"https://www.w3schools.com/\">W3 Schools</a>. \n        I don't suggest that you keep this extension on; it will lecture you every time you go to Github, Wikipedia, Youtube or any other popular website. However, I am glad to have made this and have another project to look back at.</p>\n        \n        <h3>A Scraped Idea that could have been grand</h3>\n        <p>In Late October, I had the idea to try making an incremental game about space travel called Comet Sense. Inspired by <a href=\"https://store.steampowered.com/app/1103100/1000_days_to_escape/\">1000 Days to Escape</a> and <a href=\"https://orteil.dashnet.org/cookieclicker\">Cookie Clicker</a>, I wanted to try and make a unique incremental game loaded with story and conflict. Incremental games are hard to do right. Since there are so many, you have to make something polished and grand without being too simple and familiar. I watched a TED talk titled, <a href=\"https://www.youtube.com/watch?v=6pY7EjqD3QA\">The Four-Letter Code to Selling Anything</a> by Derek Thompson who talked about how content needs to have the perfect combination of novelty and familiarity. I thought I could pull that off with this game. The problem with making a large game with a deep story is to have the motivation to continue and reach a final product. In the case of Comet Sense, I quickly burnt out. I'm pretty confident that was because <b>I didn't map out how the game would play and feel.</b> The most important thing to do before even making the UI of a vast game is to map it out beforehand. I know, I don't want to do that either, I just want to get to making the thing. I'm not much of a game ideas expert, which is why I prefer making simpler games like <a href=\"/javascript/clearance\">Clearance</a> or <a href=\"/javascript/starstrike\">Starstrike.</a> People totally underestimate the difficulty of coming up with game ideas, it's really hard to find that perfect ratio of familiarity.</p>\n        "
      ]
    },
    {
      "date": "Nov 24th, 2024",
      "data": [
        "\n        <h3>A recration of Atari Breakout</h3>\n        <p>Two weeks ago I remade Atari Breakout in <b>p5.js</b>. If you've somehow never heard of this experience, Breakout is a simple paddle game where you have to break a wall of bricks with your ball to gain points. This version is pretty similar except that instead of playing with a joystick, you play with your mouse or arrow keys. Because this game is so simple, I was able to finish it in a little over a day to release it in <a href=\"https://github.com/GreyBeard42/greybeard42.github.io/releases/tag/v4.3.2\">v4.3.2</a>. This game also saves to Local Storage to save your score so you can <b>LITERALLY PLAY FOREVER.</b> This version doesn't actualy get harder or faster at this point because if you somehow haven't noticed; I'm lazy.</p>\n        \n        <br>\n        <img src=\"https://cdn.jsdelivr.net/gh/GreyBeard42/stopwatch@main/preview.png\">\n        <p>A screenshot of The Stopwatch Game</p>\n\n        <h3>The Stopwatch Game</h3>\n        <p>This is an idea I had at the store yesterday. When I'm bored, I try to land my watch's stopwatch on 42 (because The Hitchhiker's Guide to the Galaxy and Jackie Robonson of course). So, I coded this game in an hour where you have to do the same thing for a random number. This game is really just for being bored while waiting in a line or for your computer to update. If you want to beat my highscore of ten points, <a href=\"/javascript/stopwatch\">Click Here!</a></p>\n        ",
        "\n        <img src='https://cdn.jsdelivr.net/gh/GreyBeard42/breakout@main/preview.png'>\n        <p>A screenshot of my recreation of Breakout with vibrant rainbow bricks.</p>\n        \n        <img src=\"images/art/mossyStream.png\" style=\"image-rendering: pixelated;\">\n        <p>A pixel art recreation of a picture I took this winter of a rushing stream.</p>\n        <div style=\"display: flex;\">\n            <div class=\"column\" style=\"flex: 1;\">\n                <img src=\"images/photography/DSC_1052.JPG\">\n                <p>A close-up on a rocky mountian littered with shrubs.</p>\n            </div>\n            <div class=\"column\" style=\"flex: 1;\">\n                <img src=\"images/photography/DSC_1090.JPG\">\n                <p>The Blue Angles flying in formation.</p>\n            </div>\n        </div>\n        ",
        "\n        <h3>Thanksgiving Minigame</h3>\n        <p>Because I made a Halloween Minigame last month, I just <b>HAD</b> to make a Thanksgiving one as well <i>(you know I'm making a Christmas one)</i>. This game is <b>weird</b>. I said it. My game is really weird and let me tell you why. To play the game, you must feed a pig as much as you can before it <i>\"passes out\"</i>. It's a pig because it eats like a pig, get it? Anyways different foods do different things to this pig like gain lots of points or make room for seconds. <a href=\"/holiday/thanksgiving\">Click here to play the game!</a></p>\n        \n        <br>\n        <img src=\"images/blog/thanksgiving.png\">\n        <p>A screenshot of the Thanksgiving Minigame</p>\n\n        <h3>A Midsummer Night's Dream</h3>\n        <p>I've been inactive this week because... I got to act in a small adaption of the play \"A Midsummer Night's Dream\". I played as <b>Oberon; the king of the faries</b> and husband of Titania. In the show, I got to cast multiple love spells on people including Titania who fell in love with a donkey. I had a fun time, it was great :)</p>\n        "
      ]
    },
    {
      "date": "Jan 19th, 2025",
      "data": [
        "\n        <h3>Frogger</h3>\n        <p>At the begining of last month (Dec 9th, '24), I published a recreation of one of my favorite retro videogames; Frogger. The reason why I gravitated towards Frogger was it's graphics. I wanted to capture the retro vibes of early videogames that have been lost over decades. This game took almost two weeks to make with some big break days for Thanksgivng. I watched 15 year old youtube videos, sifted ancient game dumps and used them as reference to recreate the sprites and start development. One of the hardest things with making big games is doing the hard stuff after making the cool visuals. This time, I managed to finish it and get it on my site which is always really rewarding for me to see my project live and play it for a couple days (very fun and helps with bugs). If you want to try out the game, you can play it <b><a href='/javascript/frogger'> on my site</a></b> or <b><a href='https://greybeard4200.itch.io/froggr'> on my new itch profile.</a></b></p>\n        \n        <br>\n        <img src=\"https://cdn.jsdelivr.net/gh/GreyBeard42/numberart@main/preview.png\">\n        <p>A screenshot of my Number Art project</p>\n\n        <h3>Number Art</h3>\n        <p>Number art was a quick little side project I made during Frogger development. I made this to show people how cool math and programming can be. I got the idea from the end of a <a href='https://www.youtube.com/@Vihart'>Vihart</a> video when they color coded different digits. My favorite sequences to look at on Number Art are the Thue-Morse and Fibonacii sequences. <a href='/javascript/numberart'>Check it out!</a></p>\n        ",
        "\n        <img src='https://cdn.jsdelivr.net/gh/GreyBeard42/frogger@main/preview.png'>\n        <p>A screenshot of my Frogger recreation</p>\n        \n        <img src=\"images/art/sistine.png\" style=\"image-rendering: pixelated;\">\n        <p>A pixel art recreation of The Creation of Adam on the Sistne Chapple Ceiling.</p>\n        <div style=\"display: flex;\">\n            <div class=\"column\" style=\"flex: 1;\">\n                <img src=\"images/photography/nov24/DSC_0790.JPG\">\n                <p>A photo of Natural Bridges Beach</p>\n            </div>\n            <div class=\"column\" style=\"flex: 1;\">\n                <img src=\"images/photography/nov24/CSC_0803.JPG\">\n                <p>Logs hanging over a beach-side stream.</p>\n            </div>\n        </div>\n        ",
        "\n        <h3>Perlin Spill</h3>\n        <p>Perlin Spill came a couple days after Frogger was released and had the same idea as Number Art; I wanted to show people cool math stuff. Perlin Spill is mainly just Perlin Noise; a terrain function made in 1983 for the original Tron movie (thank you wikipedia). Basically, it's the math behind Minecraft generation and Computer Graphics. Perlin Spill was mainly inspired by Dwarf Fortress' graphics. I never played dwarf fortress, I was only ever intrested in how it looked and sounded. So, I found the character set they used in Dwarf Fortress (CP437) and got to work with making my own generated world. <a href='https://greybeard42.github.io/javascript/perlinspill/'>Check it out!</a></p>\n        \n        <br>\n        <img src=\"https://cdn.jsdelivr.net/gh/GreyBeard42/perlinspill@main/preview.png\">\n        <p>A screenshot of my Perlin Spill project.</p>\n\n        <h3>Space Invaders</h3>\n        <p>Space Invaders was almost like my own sequel to Frogger. Obviously, the games have no similarity to each other, but I remade Space Invaders with the same mindset I had making Frogger; I wanted to ressurect retro videogames from their era. The main problem that stopped me from making Space Invaders months ago was the green barriers. The original game's bullets left a crater in the barriers which was hard for me to recreate because of the hitbox logic. I ended up making each barrier a set of columns instead of individual pixels to simplify my workload. Otherwise, the game is pretty similar to the original. <a href='/javascript/spaceinvaders'>Play here</a> or <a href='https://greybeard4200.itch.io/spce-invders'>on itch</a>.</p>\n        "
      ]
    }
  ]